In [2]:
import pandas as pd

In [7]:
menu = pd.Series(['비빔밥', '김치찌개', '된장찌개'])
price = pd.Series([10000, 9000, 8000])
display(menu,price)
print(menu)
print(price)
# 확인: menu

0     비빔밥
1    김치찌개
2    된장찌개
dtype: object

0    10000
1     9000
2     8000
dtype: int64

0     비빔밥
1    김치찌개
2    된장찌개
dtype: object
0    10000
1     9000
2     8000
dtype: int64

In [8]:
df_from_series = pd.DataFrame({
    '메뉴': menu,
    '가격': price
})
df_from_series

# 확인: df_from_series
# Key_value로 오브젝트 생성한다.

     메뉴     가격
0   비빔밥  10000
1  김치찌개   9000
2  된장찌개   8000

In [9]:
df = pd.DataFrame({
    '메뉴': ['비빔밥', '김치찌개', '된장찌개'],
    '가격': [10000, 9000, 8000],
    '원산지': ['국내산', '국내산', '국내산']
})
df

# 확인: df

     메뉴     가격  원산지
0   비빔밥  10000  국내산
1  김치찌개   9000  국내산
2  된장찌개   8000  국내산

In [8]:
menu_series = df['메뉴']     # 타입: pandas.Series
# 확인: menu_series, type(menu_series)
menu_series, type(menu_series)

(0     비빔밥
 1    김치찌개
 2    된장찌개
 Name: 메뉴, dtype: object,
 pandas.core.series.Series)

In [13]:
menu_df = df[['메뉴']]       # 타입: pandas.DataFrame
# 확인: menu_df, type(menu_df)
menu_df

     메뉴
0   비빔밥
1  김치찌개
2  된장찌개

In [10]:
menu_price_df = df[['메뉴', '가격']]
# 확인: menu_price_df
menu_price_df

     메뉴     가격
0   비빔밥  10000
1  김치찌개   9000
2  된장찌개   8000

In [13]:
print('df          : ', type(df))
print("df['가격']   : ", type(df['가격']))     # Series
print("df[['가격']] : ", type(df[['가격']]))   # DataFrame

df          :  <class 'pandas.core.frame.DataFrame'>
df['가격']   :  <class 'pandas.core.series.Series'>
df[['가격']] :  <class 'pandas.core.frame.DataFrame'>

In [17]:
# 첫 번째 행(인덱스 0) 전체
row0 = df.loc[0]


# 인덱스 0~1 범위(끝 포함)
rows_0_to_1 = df.loc[0:1]

# 조건식: 가격이 9000 이상인 행
rows_price_ge_9000 = df.loc[df['가격'] >= 9000, ['메뉴', '가격','원산지']]


rows_price_ge_9000

     메뉴     가격  원산지
0   비빔밥  10000  국내산
1  김치찌개   9000  국내산

In [30]:
# 첫 번째 행(정수 위치 0)
row0_iloc = df.iloc[0]

# 첫 2행(0,1)과 앞의 2개 컬럼(0,1)
sub_iloc = df.iloc[0:3, 0:3]
sub_iloc

     메뉴     가격  원산지
0   비빔밥  10000  국내산
1  김치찌개   9000  국내산
2  된장찌개   8000  국내산

In [65]:
# 예: 10% 할인 가격 컬럼 추가
df['할인가'] = (df['가격'] * 0.9).astype(int)
df

TypeError: can't multiply sequence by non-int of type 'float'

In [34]:
# 예: '김치찌개' 가격 9500으로 변경
df.loc[df['메뉴'] == '김치찌개', '가격'] = 9500

df

     메뉴     가격  원산지   할인가
0   비빔밥  10000  국내산  9000
1  김치찌개   9500  국내산  8100
2  된장찌개   8000  국내산  7200

In [35]:
# 예: '할인가' 컬럼 삭제
df = df.drop(columns=['할인가'])
df

     메뉴     가격  원산지
0   비빔밥  10000  국내산
1  김치찌개   9500  국내산
2  된장찌개   8000  국내산

In [39]:
# 문제1
fruits = pd.Series(['사과','바나나','포도'])

fruits

0     사과
1    바나나
2     포도
dtype: object

In [21]:
df = pd.DataFrame({
    '상품' :['키보드', '마우스', '모니터'],
    '가격' : [30000,15000,200000],
    '재고' :[10,24,6]
})

int64

In [4]:
# 단일 컬럼 선택 예제
prod_s = df['상품']
prod_df = df[['상품']]
prod_df

    상품
0  키보드
1  마우스
2  모니터

In [5]:
# 여러 컬럼 선택
price_veiw = df[['상품','가격']]
price_veiw

    상품      가격
0  키보드   30000
1  마우스   15000
2  모니터  200000

In [18]:
# loc로 조건 필터링

expensive = df.loc[df['가격'] >= 20000, ['상품', '가격']]
expensive

    상품      가격
0  키보드   30000
2  모니터  200000

In [7]:
#loc로 값 수정
df.loc[df['상품'] == '마우스', '가격'] = 17000
df

    상품      가격  재고
0  키보드   30000  10
1  마우스   17000  24
2  모니터  200000   6

In [8]:
sub_iloc = df.iloc[0:2, 0:2]
sub_iloc

    상품     가격
0  키보드  30000
1  마우스  17000

In [19]:
# 새 컬럼 추가 df에 부가세 포함 가격(10% 가산)을 정수형으로 계산하여 부가세포함가 컬럼으로 추가
df['부가세포함가'] = (df['가격'] * 1.10).astype(int)
df

    상품      가격  재고  부가세포함가
0  키보드   30000  10   33000
1  마우스   15000  24   16500
2  모니터  200000   6  220000

In [20]:
# df를 가격 기준 내림차순으로 정렬
df_sorted = df.sort_values(by ='가격', ascending=False)
df_sorted

    상품      가격  재고  부가세포함가
2  모니터  200000   6  220000
0  키보드   30000  10   33000
1  마우스   15000  24   16500